{"class_name": "Functional", "config": {"name": "model", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 100, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "registered_name": null, "name": "input_1", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "TimeDistributed", "config": {"name": "time_distributed", "trainable": true, "dtype": "float32", "layer": {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 100, 3]}}}, "registered_name": null, "build_config": {"input_shape": [null, 32, 100, 3]}, "name": "time_distributed", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 32, 300]}, "name": "dense", "inbound_nodes": [[["time_distributed", 0, 0, {}]]]}, {"module": null, "class_name": "TransformerBlock", "config": {"embed_dim": 128, "num_heads": 4, "ff_dim": 128}, "registered_name": "Custom>TransformerBlock", "build_config": {"input_shape": [null, 32, 128]}, "name": "transformer_block", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"module": null, "class_name": "TransformerBlock", "config": {"embed_dim": 128, "num_heads": 4, "ff_dim": 128}, "registered_name": "Custom>TransformerBlock", "build_config": {"input_shape": [null, 32, 128]}, "name": "transformer_block_1", "inbound_nodes": [[["transformer_block", 0, 0, {}]]]}, {"module": null, "class_name": "TransformerBlock", "config": {"embed_dim": 128, "num_heads": 4, "ff_dim": 128}, "registered_name": "Custom>TransformerBlock", "build_config": {"input_shape": [null, 32, 128]}, "name": "transformer_block_2", "inbound_nodes": [[["transformer_block_1", 0, 0, {}]]]}, {"module": null, "class_name": "TransformerBlock", "config": {"embed_dim": 128, "num_heads": 4, "ff_dim": 128}, "registered_name": "Custom>TransformerBlock", "build_config": {"input_shape": [null, 32, 128]}, "name": "transformer_block_3", "inbound_nodes": [[["transformer_block_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "registered_name": null, "build_config": {"input_shape": [null, 32, 128]}, "name": "global_average_pooling1d", "inbound_nodes": [[["transformer_block_3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 128]}, "name": "dropout_8", "inbound_nodes": [[["global_average_pooling1d", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 128]}, "name": "dense_9", "inbound_nodes": [[["dropout_8", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 64]}, "name": "dropout_9", "inbound_nodes": [[["dense_9", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "dtype": "float32", "units": 40, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64]}, "name": "dense_10", "inbound_nodes": [[["dropout_9", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_10", 0, 0]]}, "keras_version": "2.15.0", "backend": "tensorflow"}